# IFCExternalServiceUIData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExternalServiceUIData Class
Members See Also
---
UI data wrapper for IFCExternalServiceUIData.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class IFCExternalServiceUIData : IDisposable
```

Visual Basic
---
```text
Public Class IFCExternalServiceUIData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCExternalServiceUIData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..IFCExternalServiceUIData
# See Also
IFCExternalServiceUIData Members
Autodesk.Revit.UI Namespace